EDT/УТ/src/Catalogs/новаЭкспедиторы/новаЭкспедиторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаЭкспедиторы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыФизЛиц/ДополнительныеПараметрыФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыФизЛиц</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяРольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.КадровоеПеремещениеРаботниковОрганизаций</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПаспортныеДанныеФизЛиц/ПаспортныеДанныеФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортныеДанныеФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДокументВид</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСерия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументДатаВыдачи</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументКемВыдан</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДокументКодПодразделения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииПоМестуЖительства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/РаботникиОрганизации/РаботникиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетВПроектнойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/МетодикаРасчетаЗППоФизЛицам/МетодикаРасчетаЗППоФизЛицам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МетодикаРасчетаЗППоФизЛицам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВФот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОкладСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидТарифаЗП</name>
    <type>
      <types>CatalogRef.ВидыТарифовРасчетаЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/УчетБэйджейСотрудников/УчетБэйджейСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетБэйджейСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Бэйдж</name>
    <type>
      <types>CatalogRef.БэйджиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>БэйджАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ПриемНаРаботуВОрганизацию/ПриемНаРаботуВОрганизацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботуВОрганизацию</name>
  <registerRecords>InformationRegister.РаботникиОрганизации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетВПроектнойДеятельности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяРольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеНачисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛичногоТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.зпГруппыФизлиц</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНетМонет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаЭкспедиторы/Forms/ФормаЭлементаУпр/Module.bsl
&НаКлиенте
Перем лРасчетЗП_Оклад;

&НаКлиенте
Перем лРасчетЗП_НеУчаствуетВФот;

&НаКлиенте
Перем лРасчетЗП_ОкладСумма;

&НаКлиенте
Перем лРасчетЗП_ВидТарифаЗП;

//CeHbKA 09.04.2019 #2989
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Родитель.ТерминалДоставки) Тогда
		Отказ = Истина;
		Сообщить("Невозможно создание элемента вне группы с заполненным Терминалом");
		Возврат;
	КонецЕсли;
	
	ДатаРождения = Объект.ФизЛицо.ДатаРождения;
	ВозможностьРедактированияНаименования = РольДоступна("РедактированиеНаименованияСотрудников");
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		СтруктураДополнительныхПараметровФизЛицо = РегистрыСведений.ДополнительныеПараметрыФизЛиц.ИнициализироватьДополнительныеПараметры(Объект.ФизЛицо);
		
		ОсновнаяРоль = СтруктураДополнительныхПараметровФизЛицо.ОсновнаяРольСотрудника;
				
	Иначе
		Объект.ФизЛицо	= Неопределено;
		Фамилия			= "";
		Имя				= "";
		Отчество		= "";
		Объект.Наименование = "";	
	КонецЕсли; 	
	//ТолькоПросмотр = Истина;
	
	//Геннадий #4711 18.01.2022 ++
	Если ЗначениеЗаполнено(Объект.ФизЛицо.КодНетМонет) Тогда
		
		КодНетМонет = Объект.ФизЛицо.КодНетМонет; 
		
	КонецЕсли;
	//Геннадий #4711 18.01.2022 --
	
	//Асеев 15.02.2023 (Задача № 4985)>>>
	Если Объект.ФизЛицо.Пустая() Тогда
		Элементы.ГруппаПаспортныеДанные.Доступность = Ложь;
	Иначе
		ПаспортныеДанные = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(, Новый Структура("ФизЛицо", Объект.ФизЛицо));
		ДокументСерия = ПаспортныеДанные.ДокументСерия;
		ДокументНомер = ПаспортныеДанные.ДокументНомер;
		ДокументДатаВыдачи = ПаспортныеДанные.ДокументДатаВыдачи;
		ДокументКемВыдан = ПаспортныеДанные.ДокументКемВыдан;
		ДокументКодПодразделения = ПаспортныеДанные.ДокументКодПодразделения;
		//Асеев 15.02.2023 (Задача № 4985)<<<
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ФизЛицо", Объект.ФизЛицо);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЗ_ПриемНаРаботу.Период КАК ДатаПриемаНаРаботу
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		РаботникиОрганизации.Период КАК Период
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
		|	ГДЕ
		|		РаботникиОрганизации.ФизЛицо = &ФизЛицо
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		Период УБЫВ) КАК ВЗ_МаксПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
		|		ПО ВЗ_МаксПериод.Период = РаботникиОрганизации.Период
		|			И (РаботникиОрганизации.ФизЛицо = &ФизЛицо)
		|			И (РаботникиОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			РаботникиОрганизации.Период КАК Период
		|		ИЗ
		|			РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
		|		ГДЕ
		|			РаботникиОрганизации.ФизЛицо = &ФизЛицо
		|			И РаботникиОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			Период УБЫВ) КАК ВЗ_ПриемНаРаботу
		|		ПО (ИСТИНА)";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаПриемаНаРаботу = Выборка.ДатаПриемаНаРаботу;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
//CeHbKA 09.04.2019 #2989


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьРеквизитыРасчетаЗПИзРСМетодикаРасчетаЗП();
	
	ЗаполнитьПромежуточныеЗначения();
	
	//CeHbKA 09.04.2019 #2989
	РаботаСФизЛицамиКлиент.ЗаполнитьФИО(ЭтаФорма);
	//Геннадий 09.06.2020 ->
	РаботаСФизЛицамиКлиент.ЗаполнитьПрочиеПараметры(ЭтаФорма);
	//Геннадий 09.06.2020 <-
	РаботаСФизЛицамиКлиент.ДоступностьНаименованияИФИО(ЭтаФорма);	
	//CeHbKA 09.04.2019 #2989
	
	//ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//CeHbKA 09.04.2019 #2989
	Если РаботаСФизЛицамиКлиент.ПроверитьЗаполнениеПоляФормы(ЭтаФорма, "Фамилия")
		ИЛИ РаботаСФизЛицамиКлиент.ПроверитьЗаполнениеПоляФормы(ЭтаФорма, "Имя")
		ИЛИ РаботаСФизЛицамиКлиент.ПроверитьЗаполнениеПоляФормы(ЭтаФорма, "ДатаРождения") Тогда
		Отказ = Истина;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		
		Если ПроверкаФИО Тогда
			Отказ = РаботаСФизЛицамиКлиент.ПроверитьФИО(ЭтаФорма);
		КонецЕсли; 
		
		Если НЕ Отказ И НЕ ПроверкаФИО Тогда
			
			СтароеФИО = РаботаСФизЛицамиКлиент.НаименованиеФИОВСтруктуру(Объект.ФизЛицо);
			
			//Геннадий 10.06.2020 ->			
			Если РаботаСФизЛицамиКлиент.ФИОНеСовпадает(СтароеФИО, Фамилия, Имя, Отчество) 
				ИЛИ ДРПоменялось ИЛИ НомерТелПоменялся ИЛИ КомментарийПоменялся Тогда
			//Геннадий 10.06.2020 <-
			
				МассивОднофамильцев = ОбработатьНаименованиеИФизЛицо(СтароеФИО);
				
				Если Объект.ФизЛицо.Пустая() Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "ВНИМАНИЕ!!! Запись невозможна!"+Символы.ПС+"Физ. лицо с таким ФИО уже существует и привязано к другому экспедитору!";
					Сообщение.Поле = "Наименование";
					Сообщение.Сообщить(); 
					
					Отказ = Истина;
				КонецЕсли;
				
				РаботаСФизЛицамиКлиент.СообщитьОднофамильцев(МассивОднофамильцев);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	//CeHbKA 09.04.2019 #2989
		
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если МодифицированностьДопПараметров Тогда
		//Марочкин закомментировано 08.12.2023
		//РегистрыСведений.ДополнительныеПараметрыФизЛиц.ДобавлениеИзменениеПараметровФизЛица(Объект.ФизЛицо, ОсновнаяРоль);
		//Марочкин закомментировано 08.12.2023
	КонецЕсли;
	
	//Геннадий #4711 18.01.2022 ++
	Если КодНетМонет <> Объект.ФизЛицо.КодНетМонет Тогда
		
		ФизЛицоОб = Объект.ФизЛицо.ПолучитьОбъект();
		ФизЛицоОб.КодНетМонет = КодНетМонет;
		ФизЛицоОб.Записать();
		Сообщить("Для физ. лица " + Объект.ФизЛицо + " обновлено значение поля ""Код нет монет""");
		
	КонецЕсли;
	//Геннадий #4711 18.01.2022 --

	//Асеев 15.02.2023 (Задача № 4985)>>>
	МодифицированностьПаспортныхДанных = Ложь;
	//Асеев 15.02.2023 (Задача № 4985)<<<
	
КонецПроцедуры


//CeHbKA 09.04.2019 #2989
#Область ИзменениеФИО

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	РаботаСФизЛицамиКлиент.ФИОПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьНаименованиеИФизЛицо(СтароеФИО) 
	
	//Геннадий 11.06.2020 ->
	//добавлена передача параметров НомерЛичногоТелефона, КомментарийФЛ
	Объект.ФизЛицо = Справочники.ФизическиеЛица.ОбработатьФизЛицо(Объект.ФизЛицо, Объект.Родитель.ТерминалДоставки, Фамилия, Имя, Отчество, ДатаРождения, Тип("СправочникСсылка.новаЭкспедиторы"), НомерЛичногоТелефона, КомментарийФЛ);
	//Геннадий 11.06.2020 <-
	
	Если (НЕ Объект.НаименованиеИзменено) ИЛИ (ПустаяСтрока(Объект.Наименование)) Тогда
		Объект.Наименование = Фамилия + " " + Имя + " " + Отчество;
	КонецЕсли; 

	
	Если НЕ Объект.ФизЛицо.Пустая() Тогда
		
		МассивОднофамильцев = Справочники.ФизическиеЛица.ПроверитьОднофамильцев(Объект.ФизЛицо);
		
		Если (МассивОднофамильцев.Количество() > 0) И (НЕ Объект.НаименованиеИзменено) Тогда
			Объект.Наименование = Фамилия + " " + Имя + " " + Отчество + " (" + Формат(ДатаРождения, "ДЛФ=Д") + ")";
		КонецЕсли;
		
		Возврат МассивОднофамильцев;
		
	КонецЕсли;
	
	МассивОднофамильцев = Новый Массив;
	
	Возврат МассивОднофамильцев; 

КонецФункции // ()

&НаКлиенте
Процедура НаименованиеИзмененоПриИзменении(Элемент)	
	
	РаботаСФизЛицамиКлиент.ДоступностьНаименованияИФИО(ЭтаФорма);
	
	Если НЕ Объект.НаименованиеИзменено Тогда
		РаботаСФизЛицамиКлиент.ЗаполнитьНаименование(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСФизЛицамиКлиент.ПроверитьСменуДатыРождения(ВыбранноеЗначение, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	РаботаСФизЛицамиКлиент.ПроверитьСменуДатыРождения(Текст, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 
//CeHbKA 09.04.2019 #2989

&НаСервере
Процедура ЗаполнитьРеквизитыРасчетаЗПИзРСМетодикаРасчетаЗП()
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	МетодикаРасчетаЗППоФизЛицамСрезПоследних.Период КАК Период,
	|	МетодикаРасчетаЗППоФизЛицамСрезПоследних.Оклад КАК Оклад,
	|	МетодикаРасчетаЗППоФизЛицамСрезПоследних.НеУчаствуетВФот КАК НеУчаствуетВФот,
	|	МетодикаРасчетаЗППоФизЛицамСрезПоследних.ОкладСумма КАК ОкладСумма,
	|	МетодикаРасчетаЗППоФизЛицамСрезПоследних.ВидТарифаЗП КАК ВидТарифаЗП
	|ИЗ
	|	РегистрСведений.МетодикаРасчетаЗППоФизЛицам.СрезПоследних КАК МетодикаРасчетаЗППоФизЛицамСрезПоследних
	|ГДЕ
	|	МетодикаРасчетаЗППоФизЛицамСрезПоследних.ФизЛицо = &ФизЛицо";
	Зап.УстановитьПараметр("ФизЛицо", Объект.Ссылка);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		РасчетЗП_ДатаСведений = Выб.Период;
		РасчетЗП_Оклад = Выб.Оклад;
		РасчетЗП_НеУчаствуетВФот = Выб.НеУчаствуетВФот;
		РасчетЗП_ОкладСумма = Выб.ОкладСумма;
		РасчетЗП_ВидТарифаЗП = Выб.ВидТарифаЗП;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПромежуточныеЗначения()
	лРасчетЗП_Оклад = РасчетЗП_Оклад;
	лРасчетЗП_НеУчаствуетВФот = РасчетЗП_НеУчаствуетВФот;
	лРасчетЗП_ОкладСумма = РасчетЗП_ОкладСумма;
	лРасчетЗП_ВидТарифаЗП = РасчетЗП_ВидТарифаЗП;
КонецПроцедуры	


&НаКлиенте
Процедура РасчетЗП_НеУчаствуетВФотПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДиалогом()
	Если РасчетЗП_НеУчаствуетВФот Тогда
		Элементы.РасчетЗП_ВидТарифаЗП.Доступность = Ложь;
		Элементы.РасчетЗП_Оклад.Доступность = Ложь;
		Элементы.РасчетЗП_ОкладСумма.Доступность = Ложь;
	Иначе
		Элементы.РасчетЗП_ВидТарифаЗП.Доступность = Истина;
		Элементы.РасчетЗП_Оклад.Доступность = Истина;
		Элементы.РасчетЗП_ОкладСумма.Доступность = Истина;
	КонецеСли;	
	
	ПроверкаАктуальногоБейджа();
КонецПроцедуры	

&НаСервере
Процедура ПроверкаАктуальногоБейджа()
	// проверка наличия актуального бэйджа
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	БэйджиСотрудников.Ссылка КАК Ссылка,
	|	УчетБэйджейСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(УчетБэйджейСотрудниковСрезПоследних.БэйджАктуален, ЛОЖЬ) КАК БэйджАктуален
	|ИЗ
	|	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетБэйджейСотрудников.СрезПоследних(, ) КАК УчетБэйджейСотрудниковСрезПоследних
	|		ПО БэйджиСотрудников.Владелец = УчетБэйджейСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	БэйджиСотрудников.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда			
		Если Рез.БэйджАктуален Тогда			
			Элементы.ФормаБейджНеАктуален.Доступность = Истина;			
		Иначе
			Элементы.ФормаБейджНеАктуален.Доступность = Ложь;
		КонецЕсли;				
	Иначе
		Элементы.ФормаБейджНеАктуален.Доступность = Ложь;	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура БейджНеАктуален(Команда)
	Бэйдж = ПолучитьБэйджНаСервере(Объект.Ссылка);
	Если Бэйдж <> Неопределено Тогда
		Парам = Новый Структура("Бэйдж", Бэйдж);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтвета_БэйджНеАктуален", ЭтаФорма, Парам), "Аннулировать бэйдж?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтвета_БэйджНеАктуален(Ответ, Парам) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		Бэйдж = Парам.Бэйдж;
		Если Бэйдж <> Неопределено Тогда	
			mas.ДеАктуализироватьБэйдж(Бэйдж);	
			Элементы.ФормаБейджНеАктуален.Доступность = Ложь;
		Иначе
			//#Если Клиента Тогда
			//	Сообщить("У сотрудника нет активного бэйджа");
			//#КонецЕсли
		КонецЕсли;
		
	Иначе
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБэйджНаСервере(Владелец) Экспорт
	
	// ищем бэйдж
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	БэйджиСотрудников.Ссылка КАК Ссылка,
	|	УчетБэйджейСотрудниковСрезПервых.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(УчетБэйджейСотрудниковСрезПервых.БэйджАктуален, ЛОЖЬ) КАК БэйджАктуален
	|ИЗ
	|	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетБэйджейСотрудников.СрезПервых КАК УчетБэйджейСотрудниковСрезПервых
	|		ПО БэйджиСотрудников.Владелец = УчетБэйджейСотрудниковСрезПервых.Сотрудник
	|ГДЕ
	|	БэйджиСотрудников.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда			
		Если Рез.БэйджАктуален Тогда			
			
			Возврат Рез.ссылка;		
		Иначе
			Сообщить("Бэйдж сотрудника более не актуален. ");
			Возврат Неопределено;	
		КонецЕсли;				
	Иначе
		Сообщить("Нет назначенного бейджа. ");
		Возврат Неопределено;	
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура НапечататьБейдж(Команда)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Бэйдж = ПолучитьБэйджНаСервере(Объект.Ссылка);
	
	Если Бэйдж = Неопределено Тогда	
		// вопрос о создании бэйджа
		Парам = Новый Структура("Сотрудник", Объект.Ссылка);
		ТекстВопроса = "Создать и назначить бэйдж на сотрудника " + Объект.Ссылка + "?";
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьБэйдж", ЭтаФорма, Парам), ТекстВопроса, РежимДиалогаВопрос.ДаНет);   	
	Иначе
		ТабличныйДокумент = Новый ТабличныйДокумент;
		mas.НапечататьБэйджНаСервере(Бэйдж, ТабличныйДокумент);	
		ТабличныйДокумент.Показать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// Вставить содержимое обработчика.
	ЗаписатьДанныеРасчетаЗПИзРСМетодикаРасчетаЗПНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБэйдж(Парам1, Парам2) Экспорт
	
	Если Парам1 = КодВозвратаДиалога.Да Тогда 
		Бэйдж = mas.СоздатьБэйджСотрудника(Парам2.Сотрудник);	
		Элементы.ФормаБейджНеАктуален.Доступность = Истина;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		mas.НапечататьБэйджНаСервере(Бэйдж.Ссылка, ТабличныйДокумент);
		ТабличныйДокумент.Показать();
	Иначе	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеРасчетаЗПИзРСМетодикаРасчетаЗПНаКлиенте()
	ЕСли лРасчетЗП_Оклад = РасчетЗП_Оклад И 
		лРасчетЗП_НеУчаствуетВФот = РасчетЗП_НеУчаствуетВФот И
		лРасчетЗП_ОкладСумма = РасчетЗП_ОкладСумма И 
		лРасчетЗП_ВидТарифаЗП = РасчетЗП_ВидТарифаЗП Тогда
		Возврат;
	КонецеСли;	
	ЗаписатьДанныеРасчетаЗПИзРСМетодикаРасчетаЗП();
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьДанныеРасчетаЗПИзРСМетодикаРасчетаЗП()
	
	ТекД = ТекущаяДата();
	
	Наб = РегистрыСведений.МетодикаРасчетаЗППоФизЛицам.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТекД);
	Наб.Отбор.ФизЛицо.Установить(Объект.Ссылка);
	
	Нов = Наб.Добавить();
	
	Нов.Период = ТекД;
	Нов.ФизЛицо = Объект.Ссылка;
	Нов.ВидТарифаЗП = РасчетЗП_ВидТарифаЗП;
	Нов.НеУчаствуетВФот = РасчетЗП_НеУчаствуетВФот;
	Нов.ОкладСумма = РасчетЗП_ОкладСумма;
	Нов.Оклад = РасчетЗП_Оклад;
	
	Наб.Записать();
	
КонецПроцедуры	


&НаКлиенте
Процедура МодифицированностьДополнительныхПараметровПриИзменении(Элемент)
	МодифицированностьДопПараметров = Истина;
КонецПроцедуры

//Геннадий 10.06.2020 ->
&НаКлиенте
Процедура НомерЛичногоТелефонаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСФизЛицамиКлиент.ПроверитьСменуТелефона(Текст, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийФЛОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСФизЛицамиКлиент.ПроверитьСменуКомментария(Текст, ЭтаФорма);
КонецПроцедуры
//Геннадий 10.06.2020 <-

//Асеев 15.02.2023 (Задача № 4985)>>>
&НаКлиенте
Процедура ДокументСерияПриИзменении(Элемент)
	МодифицированностьПаспортныхДанных = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументНомерПриИзменении(Элемент)
	МодифицированностьПаспортныхДанных = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументКемВыданПриИзменении(Элемент)
	МодифицированностьПаспортныхДанных = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументДатаВыдачиПриИзменении(Элемент)
	МодифицированностьПаспортныхДанных = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументКодПодразделенияПриИзменении(Элемент)
	МодифицированностьПаспортныхДанных = Истина;
КонецПроцедуры
//Асеев 15.02.2023 (Задача № 4985)<<<

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Асеев 15.02.2023 (Задача № 4985)>>>
	Если МодифицированностьПаспортныхДанных Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыУдостоверяющиеЛичность.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
		|ГДЕ
		|	ДокументыУдостоверяющиеЛичность.КодИМНС = ""21""";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаписьРегистра = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.Период = ТекущаяДата();
			ЗаписьРегистра.ФизЛицо = ТекущийОбъект.ФизЛицо;
			ЗаписьРегистра.ДокументВид = Выборка.Ссылка;
			ЗаписьРегистра.ДокументСерия = ДокументСерия;
			ЗаписьРегистра.ДокументНомер = ДокументНомер;
			ЗаписьРегистра.ДокументДатаВыдачи = ДокументДатаВыдачи;
			ЗаписьРегистра.ДокументКемВыдан = ДокументКемВыдан;
			ЗаписьРегистра.ДокументКодПодразделения = ДокументКодПодразделения;
			ЗаписьРегистра.Записать();
		КонецЕсли;
	КонецЕсли;
	//Асеев 15.02.2023 (Задача № 4985)<<<
	
КонецПроцедуры
